; domain
(define (domain orbital)

    (:requirements :typing :fluents)

    (:types
        module - object
    )

    (:predicates
        (linked ?f1 - module ?f2 - module)
    )

    (:functions
        (oxygen ?b - module)
        (power_drain)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action vent-fast
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 4) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 4) (increase (oxygen ?f2) 2) (increase (power_drain) 1))
    )

    (:action vent-slow
        :parameters (?f1 - module ?f2 - module)
        :precondition (and (>= (oxygen ?f1) 1) (linked ?f1 ?f2))
        :effect (and(decrease (oxygen ?f1) 1) (increase (oxygen ?f2) 1))
    )

)

; problem
(define (problem instance_15_22)
  (:domain orbital)
  (:objects
    module0  module1  module2  module3  module4  module5  module6  module7  module8  module9  module10  module11  module12  module13  module14  - module
  )
  (:init
        (= (power_drain) 0)
    (= (oxygen module0) 0)
    (= (oxygen module1) 0)
    (= (oxygen module2) 1)
    (= (oxygen module3) 1)
    (= (oxygen module4) 22)
    (= (oxygen module5) 0)
    (= (oxygen module6) 0)
    (= (oxygen module7) 0)
    (= (oxygen module8) 1)
    (= (oxygen module9) 1)
    (= (oxygen module10) 0)
    (= (oxygen module11) 1)
    (= (oxygen module12) 0)
    (= (oxygen module13) 0)
    (= (oxygen module14) 1)

    (linked module0 module1)
    (linked module0 module2)
    (linked module0 module3)
    (linked module0 module4)
    (linked module0 module5)
    (linked module0 module6)
    (linked module0 module7)
    (linked module0 module8)
    (linked module0 module9)
    (linked module0 module10)
    (linked module0 module11)
    (linked module0 module12)
    (linked module0 module13)
    (linked module0 module14)
    (linked module1 module0)
    (linked module2 module0)
    (linked module3 module0)
    (linked module4 module0)
    (linked module5 module0)
    (linked module6 module0)
    (linked module7 module0)
    (linked module8 module0)
    (linked module9 module0)
    (linked module10 module0)
    (linked module11 module0)
    (linked module12 module0)
    (linked module13 module0)
    (linked module14 module0)

  )
  (:goal
    (and
      (>= (oxygen module0) 1)
      (>= (oxygen module1) 1)
      (>= (oxygen module2) 1)
      (>= (oxygen module3) 1)
      (>= (oxygen module4) 1)
      (>= (oxygen module5) 1)
      (>= (oxygen module6) 1)
      (>= (oxygen module7) 1)
      (>= (oxygen module8) 1)
      (>= (oxygen module9) 1)
      (>= (oxygen module10) 1)
      (>= (oxygen module11) 1)
      (>= (oxygen module12) 1)
      (>= (oxygen module13) 1)
      (>= (oxygen module14) 1)

      (>= (+ (* 1.3 (oxygen module0))(+ (* 1.4 (oxygen module1))(+ (* 1.4 (oxygen module2))(+ (* 1.1 (oxygen module3))(+ (* 1.0 (oxygen module4))(+ (* 1.3 (oxygen module5))(+ (* 1.1 (oxygen module6))(+ (* 1.3 (oxygen module7))(+ (* 1.0 (oxygen module8))(+ (* 1.8 (oxygen module9))(+ (* 1.9 (oxygen module10))(+ (* 1.1 (oxygen module11))(+ (* 1.9 (oxygen module12))(+ (* 1.6 (oxygen module13))(+ (* 1.9 (oxygen module14)) 0))))))))))))))) 30.799999999999997)
    )
  )
)

; plan
1. (vent-slow module2 module0)
   changed: (oxygen module2) from 1 to 0, (oxygen module0) from 0 to 1
   goals met: 7 of 16
2. (vent-slow module0 module14)
   changed: (oxygen module0) from 1 to 0, (oxygen module14) from 1 to 2
   goals met: 7 of 16
3. (vent-slow module3 module0)
   changed: (oxygen module3) from 1 to 0, (oxygen module0) from 0 to 1
   goals met: 7 of 16
4. (vent-slow module0 module13)
   changed: (oxygen module0) from 1 to 0, (oxygen module13) from 0 to 1
   goals met: 7 of 16
5. (vent-slow module4 module0)
   changed: (oxygen module4) from 22 to 21, (oxygen module0) from 0 to 1
   goals met: 8 of 16
6. (vent-slow module0 module12)
   changed: (oxygen module0) from 1 to 0, (oxygen module12) from 0 to 1
   goals met: 8 of 16
7. (vent-fast module4 module0)
   changed: (oxygen module4) from 21 to 17, (oxygen module0) from 0 to 2, (power_drain) from 0 to 1
   goals met: 9 of 16
8. (vent-slow module0 module10)
   changed: (oxygen module0) from 2 to 1, (oxygen module10) from 0 to 1
   goals met: 10 of 16
9. (vent-slow module0 module7)
   changed: (oxygen module0) from 1 to 0, (oxygen module7) from 0 to 1
   goals met: 10 of 16
10. (vent-slow module4 module0)
   changed: (oxygen module4) from 17 to 16, (oxygen module0) from 0 to 1
   goals met: 11 of 16
11. (vent-slow module0 module6)
   changed: (oxygen module0) from 1 to 0, (oxygen module6) from 0 to 1
   goals met: 11 of 16
12. (vent-slow module4 module0)
   changed: (oxygen module4) from 16 to 15, (oxygen module0) from 0 to 1
   goals met: 12 of 16
13. (vent-slow module0 module5)
   changed: (oxygen module0) from 1 to 0, (oxygen module5) from 0 to 1
   goals met: 12 of 16
14. (vent-slow module4 module0)
   changed: (oxygen module4) from 15 to 14, (oxygen module0) from 0 to 1
   goals met: 13 of 16
15. (vent-slow module0 module3)
   changed: (oxygen module0) from 1 to 0, (oxygen module3) from 0 to 1
   goals met: 13 of 16
16. (vent-slow module4 module0)
   changed: (oxygen module4) from 14 to 13, (oxygen module0) from 0 to 1
   goals met: 14 of 16
17. (vent-slow module0 module2)
   changed: (oxygen module0) from 1 to 0, (oxygen module2) from 0 to 1
   goals met: 14 of 16
18. (vent-fast module4 module0)
   changed: (oxygen module4) from 13 to 9, (oxygen module0) from 0 to 2, (power_drain) from 1 to 2
   goals met: 15 of 16
19. (vent-slow module0 module1)
   changed: (oxygen module0) from 2 to 1, (oxygen module1) from 0 to 1
   goals met: 16 of 16
